{"ID":1258,"Author":{"Name":"cloudnull","ID":0,"FullName":"","Gravatar":"cf2f6f839ab99e455ef51a97122175d4"},"Title":"Setting-up GRUB2 Properly for Ubuntu 12.04 Running on XenServer","Description":"\u003cdiv class=\"content\"\u003e\u003cp\u003eWhat we are doing here :\u003c/p\u003e\n\n\u003cp\u003eIn this screen cast we are going to be setting up (fixing) a Ubuntu Linux 12.04 LTS instance running on XenServer such that the menu.lst file is never broken by the injection of UUIDs on installation of a Kernel or through distribution upgrades.  \u003c/p\u003e\n\n\u003cp\u003eWhy we are doing it :\u003c/p\u003e\n\n\u003cp\u003eIn Ubuntu, if you install an updated Kernel and or do a distribution upgrade you may be asked to use a package maintainers version of Ubuntu\u0026#39;s menu.lst.  If you are asked to update the menu.lst file you and choose to install the \u0026#34;Package maintainers\u0026#34; version of the file you will break your installation of Ubuntu.  This is because UUIDs are injected into the menu.lst file and XenServer does not know how to handle these UUID entries when it attempts to boot the instance.\u003c/p\u003e\n\n\u003cp\u003eIf you have Hypervisor access you will see something like this when you attempt to boot the instance.  \u003c/p\u003e\n\n\u003cp\u003eERROR:Using  to parse /grub/menu.lst:\u003cbr/\u003e\n   [ Traceback (most recent call last):;\u003cbr/\u003e\n      File \\\u0026#34;/usr/bin/pygrub\\\u0026#34;, line 746, in ?;\u003cbr/\u003e\n      raise RuntimeError, \\\u0026#34;Unable to find partition containing kernel\\\u0026#34;;\u003cbr/\u003e\n   RuntimeError: Unable to find partition containing kernel;  ]\u003c/p\u003e\n\n\u003cp\u003eIf you don\u0026#39;t have hypervisor access you wont see these errors but you will know things are broken because your instance will fail to boot.  \u003c/p\u003e\n\n\u003cp\u003eCheck this post for more information on how to fix an instance that has already been effected by these problems : \u003ca href=\"http://rackerua.com/2012/07/virtual-instance-fails-to-boot-after-an-upgrade/\"\u003ehttp://rackerua.com/2012/07/virtual-instance-fails-to-boot-after-an-upgrade/\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e","Time":"2012-09-29T02:03:33Z","Tags":["Linux","bash","xterm"]}